# 实习三：非关系数据
---
## 组员：陈萧白，凤大骅，万承志

本次实习需要完成窗口查询，Json数据的读取、查询、输出，以及递归查询。我们先连接数据库，然后依次完成练习。

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://stu2000012926:stu2000012926@162.105.146.37:43306
%sql use stu2000012926;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.

[]

In [5]:
%%sql
show tables;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
5 rows affected.

[('aggResult',),
 ('max_slidingWin',),
 ('originData',),
 ('stock',),
 ('sum_slidingWin',)]

## 练习一：窗口函数
---
### 由于中间有大部分因子都有rank参数，因此并没有严格遵照每20个因子来实现一个，但总共实现的因子仍为5个。同时根据数据规模调整了部分因子的常数参数

首先建立一张表，并将已经获取的数据导入表中

In [3]:
%%sql
set foreign_key_checks=0;

drop table if exists stock;

CREATE TABLE stock (
    id INT UNSIGNED PRIMARY KEY,
    ts_code VARCHAR(10),
    trade_data DATE,
    open FLOAT,
    high FLOAT,
    low FLOAT,
    close FLOAT,
    pre_close FLOAT,
    chg FLOAT,
    pct_chg FLOAT,
    vol DOUBLE,
    amount DOUBLE
);

set foreign_key_checks=0;

INSERT INTO stock VALUES (2817,'600019.SH','2011-01-04',6.44,6.56,6.31,6.55,6.39,0.16,2.50,572249.83,369381.672);
INSERT INTO stock VALUES (2816,'600019.SH','2011-01-05',6.49,6.50,6.42,6.45,6.55,-0.10,-1.53,334574.19,215978.272);
INSERT INTO stock VALUES (2815,'600019.SH','2011-01-06',6.46,6.50,6.39,6.46,6.45,0.01,0.16,248061.88,159829.914);
INSERT INTO stock VALUES (2814,'600019.SH','2011-01-07',6.46,6.68,6.41,6.56,6.46,0.10,1.55,562598.63,368965.887);
INSERT INTO stock VALUES (2813,'600019.SH','2011-01-10',6.54,6.64,6.51,6.52,6.56,-0.04,-0.61,422610.09,277610.464);
INSERT INTO stock VALUES (2812,'600019.SH','2011-01-11',6.52,6.72,6.51,6.70,6.52,0.18,2.76,608401.78,403478.981);
INSERT INTO stock VALUES (2811,'600019.SH','2011-01-12',6.72,6.90,6.67,6.83,6.70,0.13,1.94,815284.93,554413.060);
INSERT INTO stock VALUES (2810,'600019.SH','2011-01-13',6.87,6.90,6.73,6.77,6.83,-0.06,-0.88,511347.57,348201.644);
INSERT INTO stock VALUES (2809,'600019.SH','2011-01-14',6.77,6.77,6.61,6.71,6.77,-0.06,-0.89,415524.64,277649.450);
INSERT INTO stock VALUES (2808,'600019.SH','2011-01-17',6.64,6.74,6.48,6.53,6.71,-0.18,-2.68,524684.69,346912.702);

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
SELECT * FROM stock;

 * mysql://stu2000012926:***@162.105.146.37:43306
10 rows affected.

[(2808, '600019.SH', datetime.date(2011, 1, 17), 6.64, 6.74, 6.48, 6.53, 6.71, -0.18, -2.68, 524684.69, 346912.702),
 (2809, '600019.SH', datetime.date(2011, 1, 14), 6.77, 6.77, 6.61, 6.71, 6.77, -0.06, -0.89, 415524.64, 277649.45),
 (2810, '600019.SH', datetime.date(2011, 1, 13), 6.87, 6.9, 6.73, 6.77, 6.83, -0.06, -0.88, 511347.57, 348201.644),
 (2811, '600019.SH', datetime.date(2011, 1, 12), 6.72, 6.9, 6.67, 6.83, 6.7, 0.13, 1.94, 815284.93, 554413.06),
 (2812, '600019.SH', datetime.date(2011, 1, 11), 6.52, 6.72, 6.51, 6.7, 6.52, 0.18, 2.76, 608401.78, 403478.981),
 (2813, '600019.SH', datetime.date(2011, 1, 10), 6.54, 6.64, 6.51, 6.52, 6.56, -0.04, -0.61, 422610.09, 277610.464),
 (2814, '600019.SH', datetime.date(2011, 1, 7), 6.46, 6.68, 6.41, 6.56, 6.46, 0.1, 1.55, 562598.63, 368965.887),
 (2815, '600019.SH', datetime.date(2011, 1, 6), 6.46, 6.5, 6.39, 6.46, 6.45, 0.01, 0.16, 248061.88, 159829.914),
 (2816, '600019.SH', datetime.date(2011, 1, 5), 6.49, 6.5, 6.42, 6.45, 6.55, -0.1, -1.53, 334574.19, 215978.272),
 (2817, '600019.SH', datetime.date(2011, 1, 4), 6.44, 6.56, 6.31, 6.55, 6.39, 0.16, 2.5, 572249.83, 369381.672)]

### 公式6：
原公式为 :`(-1 * correlation(open, volume, 10))`

由于数据规模问题，采取公式为:`(-1 * correlation(open, volume, 5))`，并舍弃前4个数据不足的行

In [5]:
%%sql
# Alpha#6: (-1 * correlation(open, volume, 5))
SELECT 
    tmp.id,
    ROUND(-1 * corr, 2) as alpha06
FROM (
    SELECT 
        id,
        (avg(open*vol) over (rows between 4 preceding and current row) 
        - avg(open) over (rows between 4 preceding and current row) 
        * avg(vol) over (rows between 4 preceding and current row))
        / (stddev_pop(open) over (rows between 4 preceding and current row)
        * stddev_pop(vol) over (rows between 4 preceding and current row)) as corr
    FROM stock
) AS tmp
WHERE id>=2812;

 * mysql://stu2000012926:***@162.105.146.37:43306
6 rows affected.

[(2812, 0.25),
 (2813, 0.0),
 (2814, -0.19),
 (2815, -0.77),
 (2816, -0.29),
 (2817, 0.28)]

### 公式23：
原公式为：`(((sum(high, 20) / 20) < high) ? (-1 * delta(high, 2)) : 0)`

由于数据规模问题，采取公式为:`(((sum(high, 3) / 3) < high) ? (-1 * delta(high, 2)) : 0)`，并舍弃前2个数据不足的行

In [6]:
%%sql
# Alpha#23: (((sum(high, 3) / 3) < high) ? (-1 * delta(high, 2)) : 0)
SELECT
    id,
    if (delta_sum_high<0, ROUND(-1*delta_high,2),0) as alpha23
FROM (
    SELECT
        id,
        sum(high) over (rows between 2 preceding and current row) 
        / 3 - high as delta_sum_high,
        (high - lag(high,2) over ()) as delta_high
    FROM stock
) AS tmp
WHERE id>= 2810;

 * mysql://stu2000012926:***@162.105.146.37:43306
8 rows affected.

[(2810, -0.16),
 (2811, -0.13),
 (2812, 0.0),
 (2813, 0.0),
 (2814, 0.0),
 (2815, 0.0),
 (2816, 0.0),
 (2817, -0.06)]

### 公式41：
原公式为:`(((high * low)^0.5) - vwap)`

In [7]:
%%sql
# Alpha#41: (((high * low)^0.5) - vwap)
SELECT
    id,
    ROUND(SQRT(high*low) - (amount/vol),2) as alpha41
FROM stock;

 * mysql://stu2000012926:***@162.105.146.37:43306
10 rows affected.

[(2808, 5.95),
 (2809, 6.02),
 (2810, 6.13),
 (2811, 6.1),
 (2812, 5.95),
 (2813, 5.92),
 (2814, 5.89),
 (2815, 5.8),
 (2816, 5.81),
 (2817, 5.79)]

### 公式53：
原公式为:`(-1 * delta((((close - low) - (high - close)) / (close - low)), 9))`

由于数据规模问题，采取公式为:`(-1 * delta((((close - low) - (high - close)) / (close - low)), 5))`，并舍弃前5个数据不足的行

In [8]:
%%sql
# Alpha#53: (-1 * delta((((close - low) - (high - close)) / (close - low)), 5))
SELECT 
    id,
    alpha53
FROM (
    SELECT
        id,
        ROUND(-1* (data - lag(data,5) over ()),2) as alpha53
    FROM (
        SELECT
            id,
            (((close - low) - (high - close)) / (close - low)) as data
        FROM stock
    ) AS tmp1
) AS tmp2
WHERE id>=2813;

 * mysql://stu2000012926:***@162.105.146.37:43306
5 rows affected.

[(2813, 7.8), (2814, 0.2), (2815, -2.68), (2816, 1.23), (2817, -0.06)]

### 公式84:
原公式为:`SignedPower(Ts_Rank((vwap - ts_max(vwap, 15.3217)), 20.7127), delta(close, 4.96796))`

由于数据规模问题，和小数的实际情况，采取公式为:`SignedPower(Ts_Rank((vwap - ts_max(vwap, 4)), 5), delta(close, 2))`，并只保留有意义的行

由于PERCENT_RANK只能对整个表生效，Ts_RANK最终使用子查询实现

In [9]:
%%sql
# Alpha#84: SignedPower(Ts_Rank((vwap - ts_max(vwap, 4)), 5), delta(close, 2))
WITH tmp1 AS (
    SELECT
        id,
        amount/vol - max(amount/vol) over (rows between 3 preceding and current row) as vwap,
        close - lag(close,2) over () as delta_close
    FROM stock
)
SELECT 
    id,
    if(ts_rank=0,0,ROUND(POWER(ts_rank, delta_close),2)) as alpha84
FROM(
    SELECT
        id,
        vwap,
        (SELECT COUNT(*)-1 FROM tmp1 t1 WHERE t1.vwap<= tmp1.vwap and t1.id<=tmp1.id and t1.id>=tmp1.id-4) / 
        (SELECT COUNT(*)-1 FROM tmp1 t1 WHERE t1.id<=tmp1.id and t1.id>=tmp1.id-4) as ts_rank,
        delta_close
    FROM tmp1
    WHERE id>=2811
) tmp2;

 * mysql://stu2000012926:***@162.105.146.37:43306
7 rows affected.

[(2811, 0.0),
 (2812, 0.0),
 (2813, 0.0),
 (2814, 0.0),
 (2815, 1.04),
 (2816, 1.0),
 (2817, 1.0)]

## 练习二：JSON
---
### 操作一：建立empolyees表

In [109]:
# 首先读取文件将employees.txt中的数据转换为json
import json

res_lst = []
with open("employees.txt", "r", encoding='utf-8') as e:
    content = e.readlines();
    for row in content:
        json_obj = dict()
        row_split = row.split()
        
        json_obj['name'] = row_split[0] + ' ' + row_split[1]
        json_obj['salary'] = float(row_split[2])
        
        subordinates = []
        cur_pos = 3
        while True:
            if row_split[cur_pos] == 'Federal':
                break
            subordinates += [row_split[cur_pos] + ' ' + row_split[cur_pos+1]]
            cur_pos += 2
        json_obj['subordinates'] = subordinates
        cur_pos += 1
        
        deductions = dict()
        deductions['Federal Taxes'] = '0.' + row_split[cur_pos].split('.')[1]
        cur_pos += 2
        deductions['State Taxes'] = '0.' + row_split[cur_pos].split('.')[1]
        cur_pos += 1
        deductions['Insurance'] = '0.' + row_split[cur_pos].split('.')[1]
        json_obj['deductions'] = deductions
        cur_pos += 1
        
        address = dict()
        address['street'] = row_split[cur_pos] + ' ' + row_split[cur_pos+1] + ' ' + row_split[cur_pos+2]
        cur_pos += 3
        address['city'] = row_split[cur_pos]
        cur_pos += 1
        address['state'] = row_split[cur_pos]
        cur_pos += 1
        address['zip'] = row_split[cur_pos]
        json_obj['address'] = address
        
        res_lst.append(json_obj)
        
json_res = json.dumps(res_lst)      
with open('employees.json', 'w', encoding='utf-8') as j:
    j.write(json_res)

In [23]:

%%sql
# 建立表格并插入数据

set @@foreign_key_checks=0;

DROP TABLE IF EXISTS employees;

CREATE TABLE employees
( 
	id  int  PRIMARY KEY AUTO_INCREMENT, 
	info  json 
);

INSERT INTO employees(info) VALUES
(
	'{
        "name": "John Doe",
        "salary": 100000.0,
        "subordinates": [
            "Mary Smith",
            "Todd Jones"
        ],
        "deductions": {
            "Federal Taxes": "0.2",
            "State Taxes": "0.05",
            "Insurance": "0.1"
        },
        "address": {
            "street": "1 Michigan Ave.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60600"
        }
    }'
),
    
(
    '{
        "name": "Mary Smith",
        "salary": 80000.0,
        "subordinates": [
            "Bill King"
        ],
        "deductions": {
            "Federal Taxes": "0.2",
            "State Taxes": "0.05",
            "Insurance": "0.1"
        },
        "address": {
            "street": "100 Ontario St.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60601"
        }
    }'
),
(    
    '{
        "name": "Todd Jones",
        "salary": 70000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "200 Chicago Ave.",
            "city": "OakPark",
            "state": "IL",
            "zip": "60700"
        }
    }'
),
(    
    '{
        "name": "Bill King",
        "salary": 60000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "300 Obscure Dr.",
            "city": "Obscuria",
            "state": "IL",
            "zip": "60100"
        }
    }'
),
(    
    '{
        "name": "Boss Man",
        "salary": 200000.0,
        "subordinates": [
            "John Doe",
            "Fred Finance"
        ],
        "deductions": {
            "Federal Taxes": "0.3",
            "State Taxes": "0.07",
            "Insurance": "0.05"
        },
        "address": {
            "street": "1 Pretentious Drive.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60500"
        }
    }'
),
(
    '{
        "name": "Fred Finance",
        "salary": 150000.0,
        "subordinates": [
            "Stacy Accountant"
        ],
        "deductions": {
            "Federal Taxes": "0.3",
            "State Taxes": "0.07",
            "Insurance": "0.05"
        },
        "address": {
            "street": "2 Pretentious Drive.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60500"
        }
    }'
),
(    
    '{
        "name": "Stacy Accountant",
        "salary": 60000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "300 Main St.",
            "city": "Naperville",
            "state": "IL",
            "zip": "60563"
        }
    }'
);

set @@foreign_key_checks=1;

SELECT * FROM employees;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
7 rows affected.
0 rows affected.
7 rows affected.

[(1, '{"name": "John Doe", "salary": 100000.0, "address": {"zip": "60600", "city": "Chicago", "state": "IL", "street": "1 Michigan Ave."}, "deductions": {"Insurance": "0.1", "State Taxes": "0.05", "Federal Taxes": "0.2"}, "subordinates": ["Mary Smith", "Todd Jones"]}'),
 (2, '{"name": "Mary Smith", "salary": 80000.0, "address": {"zip": "60601", "city": "Chicago", "state": "IL", "street": "100 Ontario St."}, "deductions": {"Insurance": "0.1", "State Taxes": "0.05", "Federal Taxes": "0.2"}, "subordinates": ["Bill King"]}'),
 (3, '{"name": "Todd Jones", "salary": 70000.0, "address": {"zip": "60700", "city": "OakPark", "state": "IL", "street": "200 Chicago Ave."}, "deductions": {"Insurance": "0.1", "State Taxes": "0.03", "Federal Taxes": "0.15"}, "subordinates": []}'),
 (4, '{"name": "Bill King", "salary": 60000.0, "address": {"zip": "60100", "city": "Obscuria", "state": "IL", "street": "300 Obscure Dr."}, "deductions": {"Insurance": "0.1", "State Taxes": "0.03", "Federal Taxes": "0.15"}, "subordinates": []}'),
 (5, '{"name": "Boss Man", "salary": 200000.0, "address": {"zip": "60500", "city": "Chicago", "state": "IL", "street": "1 Pretentious Drive."}, "deductions": {"Insurance": "0.05", "State Taxes": "0.07", "Federal Taxes": "0.3"}, "subordinates": ["John Doe", "Fred Finance"]}'),
 (6, '{"name": "Fred Finance", "salary": 150000.0, "address": {"zip": "60500", "city": "Chicago", "state": "IL", "street": "2 Pretentious Drive."}, "deductions": {"Insurance": "0.05", "State Taxes": "0.07", "Federal Taxes": "0.3"}, "subordinates": ["Stacy Accountant"]}'),
 (7, '{"name": "Stacy Accountant", "salary": 60000.0, "address": {"zip": "60563", "city": "Naperville", "state": "IL", "street": "300 Main St."}, "deductions": {"Insurance": "0.1", "State Taxes": "0.03", "Federal Taxes": "0.15"}, "subordinates": []}')]

### 操作二：查询  
完成的五个查询为：
+ 查询所有在芝加哥的雇员
+ 查询工资大于100000的雇员
+ 查询联邦税低于0.2的雇员
+ 查询John Doe的上司
+ 查询保险为0.05的所有雇员

In [19]:
%%sql
# 查询所有在芝加哥的雇员

SELECT json_extract(info, '$.name') as name
FROM employees
WHERE json_extract(info,'$.address.city')='Chicago';

 * mysql://stu2000012926:***@162.105.146.37:43306
4 rows affected.

[('"John Doe"',), ('"Mary Smith"',), ('"Boss Man"',), ('"Fred Finance"',)]

In [24]:
%%sql
# 查询工资大于100000的雇员

SELECT json_extract(info, '$.name') as name
FROM employees
WHERE json_extract(info,'$.salary') > 100000;

 * mysql://stu2000012926:***@162.105.146.37:43306
2 rows affected.

[('"Boss Man"',), ('"Fred Finance"',)]

In [79]:
%%sql
# 查询联邦税低于0.2的雇员

SELECT json_extract(info, '$.name') as name
FROM employees
WHERE CAST(json_extract(info,'$.deductions.\"Federal Taxes\"') AS DOUBLE) < 0.2;

 * mysql://stu2000012926:***@162.105.146.37:43306
3 rows affected.

[('"Todd Jones"',), ('"Bill King"',), ('"Stacy Accountant"',)]

In [92]:
%%sql
#查询John Doe的上司

SELECT json_extract(info, '$.name') as name
FROM employees
WHERE json_search(info, 'all', 'John Doe') LIKE '%subordinates%'

 * mysql://stu2000012926:***@162.105.146.37:43306
1 rows affected.

[('"Boss Man"',)]

In [96]:
%%sql
# 查询保险为0.05的所有雇员
SELECT json_extract(info, '$.name') as name
FROM employees
WHERE json_extract(info,'$.deductions.Insurance') = '0.05';

 * mysql://stu2000012926:***@162.105.146.37:43306
2 rows affected.

[('"Boss Man"',), ('"Fred Finance"',)]

### 操作三： 将employees表展开成1NF平面表  
+ 为了简洁，我们为employees的json数据起一个别名@ej
+ 由于subordinates项对应的值是一个数组，因此需要unwind操作

In [115]:
%%sql
SET @ej='[
    {
        "name": "John Doe",
        "salary": 100000.0,
        "subordinates": [
            "Mary Smith",
            "Todd Jones"
        ],
        "deductions": {
            "Federal Taxes": "0.2",
            "State Taxes": "0.05",
            "Insurance": "0.1"
        },
        "address": {
            "street": "1 Michigan Ave.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60600"
        }
    },
    {
        "name": "Mary Smith",
        "salary": 80000.0,
        "subordinates": [
            "Bill King"
        ],
        "deductions": {
            "Federal Taxes": "0.2",
            "State Taxes": "0.05",
            "Insurance": "0.1"
        },
        "address": {
            "street": "100 Ontario St.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60601"
        }
    },
    {
        "name": "Todd Jones",
        "salary": 70000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "200 Chicago Ave.",
            "city": "OakPark",
            "state": "IL",
            "zip": "60700"
        }
    },
    {
        "name": "Bill King",
        "salary": 60000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "300 Obscure Dr.",
            "city": "Obscuria",
            "state": "IL",
            "zip": "60100"
        }
    },
    {
        "name": "Boss Man",
        "salary": 200000.0,
        "subordinates": [
            "John Doe",
            "Fred Finance"
        ],
        "deductions": {
            "Federal Taxes": "0.3",
            "State Taxes": "0.07",
            "Insurance": "0.05"
        },
        "address": {
            "street": "1 Pretentious Drive.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60500"
        }
    },
    {
        "name": "Fred Finance",
        "salary": 150000.0,
        "subordinates": [
            "Stacy Accountant"
        ],
        "deductions": {
            "Federal Taxes": "0.3",
            "State Taxes": "0.07",
            "Insurance": "0.05"
        },
        "address": {
            "street": "2 Pretentious Drive.",
            "city": "Chicago",
            "state": "IL",
            "zip": "60500"
        }
    },
    {
        "name": "Stacy Accountant",
        "salary": 60000.0,
        "subordinates": [],
        "deductions": {
            "Federal Taxes": "0.15",
            "State Taxes": "0.03",
            "Insurance": "0.1"
        },
        "address": {
            "street": "300 Main St.",
            "city": "Naperville",
            "state": "IL",
            "zip": "60563"
        }
    }
]';

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.

[]

In [131]:
%%sql

SELECT *
FROM
json_table
(
@ej,
"$[*]" COLUMNS
(
   name VARCHAR(50) PATH "$.name" ,
   salary DOUBLE PATH "$.salary",
   NESTED PATH "$.subordinates[*]" COLUMNS (subordinates VARCHAR(50) PATH "$"),
   `Federal Taxes` DOUBLE PATH "$.deductions.\"Federal Taxes\"",
   `State Taxes` DOUBLE PATH "$.deductions.\"State Taxes\"",
   Insurance DOUBLE PATH "$.deductions.Insurance",
   street VARCHAR(100) PATH "$.address.street",
   city VARCHAR(100) PATH "$.address.city",
   state VARCHAR(50) PATH "$.address.state",
   `zip` VARCHAR(10) PATH "$.address.zip"
)
) as et;

 * mysql://stu2000012926:***@162.105.146.37:43306
9 rows affected.

[('John Doe', 100000.0, 'Mary Smith', 0.2, 0.05, 0.1, '1 Michigan Ave.', 'Chicago', 'IL', '60600'),
 ('John Doe', 100000.0, 'Todd Jones', 0.2, 0.05, 0.1, '1 Michigan Ave.', 'Chicago', 'IL', '60600'),
 ('Mary Smith', 80000.0, 'Bill King', 0.2, 0.05, 0.1, '100 Ontario St.', 'Chicago', 'IL', '60601'),
 ('Todd Jones', 70000.0, None, 0.15, 0.03, 0.1, '200 Chicago Ave.', 'OakPark', 'IL', '60700'),
 ('Bill King', 60000.0, None, 0.15, 0.03, 0.1, '300 Obscure Dr.', 'Obscuria', 'IL', '60100'),
 ('Boss Man', 200000.0, 'John Doe', 0.3, 0.07, 0.05, '1 Pretentious Drive.', 'Chicago', 'IL', '60500'),
 ('Boss Man', 200000.0, 'Fred Finance', 0.3, 0.07, 0.05, '1 Pretentious Drive.', 'Chicago', 'IL', '60500'),
 ('Fred Finance', 150000.0, 'Stacy Accountant', 0.3, 0.07, 0.05, '2 Pretentious Drive.', 'Chicago', 'IL', '60500'),
 ('Stacy Accountant', 60000.0, None, 0.15, 0.03, 0.1, '300 Main St.', 'Naperville', 'IL', '60563')]

### 操作四：递归查询

In [3]:
%%sql
DROP TABLE IF EXISTS Assembly;

CREATE TABLE Assembly(
    id int NOT NULL PRIMARY KEY AUTO_INCREMENT,
    part char(20),
    subpart char(20)
);

INSERT INTO
    Assembly
VALUES
    (1, 'trike', 'wheel'),
    (2, 'trike', 'frame'),
    (3, 'frame', 'seat'),
    (4, 'frame', 'pedal'),
    (5, 'wheel', 'spoke'),
    (6, 'wheel', 'tire'),
    (7, 'tire', 'rim'),
    (8, 'tire', 'tube');

SELECT
    *
FROM
    Assembly;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
8 rows affected.
8 rows affected.

[(1, 'trike', 'wheel'),
 (2, 'trike', 'frame'),
 (3, 'frame', 'seat'),
 (4, 'frame', 'pedal'),
 (5, 'wheel', 'spoke'),
 (6, 'wheel', 'tire'),
 (7, 'tire', 'rim'),
 (8, 'tire', 'tube')]

In [12]:
%%sql

WITH recursive Components (part, subpart, level) AS (
    SELECT
        part,
        subpart,
        1
    FROM
        Assembly
    UNION
    ALL
    SELECT
        A.part,
        C.subpart,
        C.level + 1
    FROM
        Assembly A,
        Components C
    WHERE
        A.subpart = C.part
)
SELECT
    *
FROM
    Components
WHERE
    part = 'trike';

 * mysql://stu2000012926:***@162.105.146.37:43306
8 rows affected.

[('trike', 'wheel', 1),
 ('trike', 'frame', 1),
 ('trike', 'tire', 2),
 ('trike', 'spoke', 2),
 ('trike', 'pedal', 2),
 ('trike', 'seat', 2),
 ('trike', 'rim', 3),
 ('trike', 'tube', 3)]

In [14]:


# 连接到 MySQL 数据库
db = pymysql.connect(host='162.105.146.37',user='stu2000012926', password='stu2000012926', port=43306,db="stu2000012926")
cursor = db.cursor()

# 执行查询语句
cursor.execute('SELECT * FROM Assembly')
results = cursor.fetchall()

# 关闭连接
cursor.close()
db.close()

In [15]:

def build_tree(data, root):
    tree = [root]
    for part, subpart in data:
        if part == root:
            tree.append(build_tree(data, subpart))
    return tree

data = [(result[1], result[2]) for result in results]
tree = build_tree(data, 'trike')

In [16]:
import json

json_data = json.dumps(tree)
print(json_data)

["trike", ["wheel", ["spoke"], ["tire", ["rim"], ["tube"]]], ["frame", ["seat"], ["pedal"]]]